---
kind: method
id: M:Autodesk.Revit.DB.SketchPlane.GetPlane
source: html/d40a539a-0009-a422-6b36-80e750eae685.htm
---
# Autodesk.Revit.DB.SketchPlane.GetPlane Method

Returns the corresponding Plane.

## Syntax (C#)
```csharp
public Plane GetPlane()
```

## Returns
The plane upon which elements created with this sketch plane will lie.